#include<iostream>
using namespace std;
/*
Напишете програма, която по дадено въведено от потребителя естествено число проверява 
дали всяка негова цифра е равна на сумата на двете цифри, намиращи се след нея.

Примери:
532110 -> да (0+1 = 1, 1+1 = 2, 1+2 = 3, 2+3 = 5 - редица на фибоначи)
7431 -> да (1+3 = 4, 3 + 4 = 7)
11235 -> не
98065 -> не
*/
int main()
{
  // Да си направим една променлива за числото и три променливи за най-десните цифри
	int n, dig1, dig2, dig3;
	cin >> n;

  // Ще си направим една булева променлива ans, която, ако срещнем една тройка цифри, които не спазват правилото, ще я направим false
  bool ans = true;
	
	while (n >= 100) // докато числото има три цифри
	{
	    dig3 = n / 100 % 10;
	    dig2 = n / 10 % 10;
        dig1 = n % 10;
		
		// Ако сборът на двете най-десни цифри НЕ е равен на следващата
		if (dig3 != dig1 + dig2)
		{
		    ans = false; // числото не изпълнява правилото
		}
		
		n /= 10;
	}
	
  if (ans) {
    cout << "YES" << endl;
  } else {
    cout << "NO" << endl;
  }

	return 0;
} 
