#include <iostream>
using namespace std;
/*
Напишете програма, която по дадени естествени числа n и k намира 
първото число, по-голямо от n, на което сумата на делителите (без самото число) е равна на k.
Пример:
n = 12, k = 15 -> 16 (16 се дели на 1, 2, 3, 4, и 8, сумата им е 15)
*/
int main()
{
	int n, k;
	int sumDels = 0;

	cin >> n >> k;
	
  // i ще върви през всички числа от n+1 докато не намерим отговора на задачата
	for (int i = n + 1;; i++)
	{
		sumDels = 0;
		
    // Да намерим сумата на делителите на i
		for (int j = 1; j < i; j++)
		{
			if (i%j == 0)
			{
			    sumDels += j;
		    }
		}
		
		if (sumDels == k) 
		{	
			cout << i << endl;
			break;
		}
	}

	return 0;
}
