#include <iostream>
using namespace std;
/*
Трайчо иска да отиде за риба, но не е сигурен дали има въдици.

Той знае от опит колко и какво му трябва за различните места, на които може да отиде.

Ако ще ходи на Искъра, ще му трябват 1 пръчка, 2 плувки, 4 вирбела, 3 оливети, 3 кукички и 150 метра корда.

Ако ще ходи на Пчелина, ще му трябват 2 пръчки, 3 плувки, 5 вирбела, 6 оливети, 10 кукички и 200 метра корда.

Ако ще ходи на Панчарево, ще му трябват 5 пръчки, 6 плувки, 12 вирбела, 7 оливети, 12 кукички и 300 метра корда.

Ако ще взима повече от една пръчка, както ще е ако ходи на Пчелина или Панчарево, ще трябва да вземе и един приятел с него.

По даден брой пръчки, брой плувки, брой вирбели, брой оливети, брой кукички, метри корда и дали ще дойде
един приятел с него, напишете булев израз, който определя дали Трайчо има такъми да си направи въдици и
да отиде за риба.
*/
int main() {
	int pruchki, pluvki, virbeli, oliveti, kukichki, korda;
	bool hasFriend;
	
	bool iskar = pruchki >= 1 && pluvki >= 2 && virbeli >= 4 && oliveti >= 3 && kukichki >= 3 && korda >= 150;

	bool pchelina = pruchki >= 2 && pluvki >= 3 && virbeli >= 5 && oliveti >= 6 && kukichki >= 10 && korda >= 200;
	
	bool pancharevo = pruchki >= 5 && pluvki >= 6 && virbeli >= 12 && oliveti >= 7 && kukichki >= 12 && korda >= 300;

	bool isGoing = iskar || ((pchelina || pancharevo) && hasFriend);
}